IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_ethernetss_regs.xml
<module id="ETHERNETSS_REGS" HW_revision="" description="ETHERNETSS Registers">
	<register id="ETHERNETSS_IPREVNUM" width="32" page="1" offset="0x0" internal="0" description="IP Revision Number">
		<bitfield id="IP_REV_MINOR" description="Minor IP Revision Number" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="IP_REV_MAJOR" description="Major IP Revision Number" begin="7" end="4" width="4" rwaccess="R"/>
	</register>
	<register id="ETHERNETSS_CTRLSTS" width="32" page="1" offset="0x4" internal="0" description="Control Register">
		<bitfield id="PHY_INTF_SEL" description="PHY Type Selection" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CLK_LM" description="MII Loop-back mode clock select" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CLK_SRC_SEL" description="Internal Clock Selection" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="FLOW_CTRL_EN" description="Back-pressure enable per receive queue." begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTPTSTRIGSEL0" width="32" page="1" offset="0x8" internal="0" description="PTP Trigger-0 select">
		<bitfield id="PTP_AUX_TS_TRIG_SEL0" description="Trigger select for Auxillary TS capture - 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTPTSTRIGSEL1" width="32" page="1" offset="0xc" internal="0" description="PTP Trigger-1 select">
		<bitfield id="PTP_AUX_TS_TRIG_SEL1" description="Trigger select for Auxillary TS capture - 1" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTPTSSWTRIG0" width="32" page="1" offset="0x10" internal="0" description="PTP SW Trigger-0">
		<bitfield id="PTP_AUX_TS_SW_TRIG0" description="SW trigger for AUX TS capture for trigger-0" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTPTSSWTRIG1" width="32" page="1" offset="0x14" internal="0" description="PTP SW Trigger-1">
		<bitfield id="PTP_AUX_TS_SW_TRIG1" description="SW trigger for AUX TS capture for trigger-1" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTPPPSR0" width="32" page="1" offset="0x18" internal="0" description="PTP PPS-0 Read">
		<bitfield id="PTP_PPS_R0" description="Registered value of Pulse Per Second-0" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="ETHERNETSS_PTPPPSR1" width="32" page="1" offset="0x1c" internal="0" description="PTP PPS-1 Read">
		<bitfield id="PTP_PPS_R1" description="Registered value of Pulse Per Second-1" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="ETHERNETSS_PTP_TSRL" width="32" page="1" offset="0x20" internal="0" description="PTP timestamp read lower 32 bits">
		<bitfield id="TSR_L" description="Time-stamp o/p from the EQOS Low" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="ETHERNETSS_PTP_TSRH" width="32" page="1" offset="0x24" internal="0" description="PTP timestamp read upper 32 bits">
		<bitfield id="TSR_H" description="Time-stamp o/p from the EQOS High" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="ETHERNETSS_PTP_TSWL" width="32" page="1" offset="0x28" internal="0" description="External Timestamp write lower 32 bits">
		<bitfield id="TSW_L" description="Time-stamp i/p from external to EQOS" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_PTP_TSWH" width="32" page="1" offset="0x2c" internal="0" description="External Timestamp write upper 32 bits">
		<bitfield id="TSW_H" description="Time-stamp i/p from external to EQOS" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ETHERNETSS_REVMII_CTRL" width="32" page="1" offset="0x30" internal="0" description="RevMII Phy Address controls">
		<bitfield id="REVMII_CORE_PHY_ADDR" description="RevMII Core Register Space offset" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="REVMII_REMOTE_PHY_ADDR" description="RevMII Remote Register Space offset" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
</module>
